In [1]:
'''
    #       # #   # ##### ####### #
    # #   # # \  /  #     #     # #
    #   #   #  \/   ##### #     # #
    #       #  #        # #  #### #
    #       #  #    ##### ####### ######
    
   Author name: Tarun Sharma 
   Schema Name:Three Tables here Piece,Provider,Provides 
'''    
import sqlalchemy
import pymysql
pymysql.install_as_MySQLdb()
sqlalchemy.create_engine('mysql://root:root@localhost/Pieces_and_Providers')
%load_ext sql
%sql mysql://root:root@localhost/Pieces_and_Providers

In [4]:
%%sql

CREATE TABLE Pieces (
 Code INTEGER PRIMARY KEY NOT NULL,
 Name TEXT NOT NULL
 );
CREATE TABLE Providers (
 Code VARCHAR(40) 
 PRIMARY KEY NOT NULL,  
 Name TEXT NOT NULL 
 );
CREATE TABLE Provides (
 Piece INTEGER, 
 FOREIGN KEY (Piece) REFERENCES Pieces(Code),
 Provider VARCHAR(40), 
 FOREIGN KEY (Provider) REFERENCES Providers(Code),  
 Price INTEGER NOT NULL,
 PRIMARY KEY(Piece, Provider) 
 );

 * mysql://root:***@localhost/Pieces_and_Providers
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql
INSERT INTO Providers(Code, Name) VALUES('HAL','Clarke Enterprises');
INSERT INTO Providers(Code, Name) VALUES('RBT','Susan Calvin Corp.');
INSERT INTO Providers(Code, Name) VALUES('TNBC','Skellington Supplies');

INSERT INTO Pieces(Code, Name) VALUES(1,'Sprocket');
INSERT INTO Pieces(Code, Name) VALUES(2,'Screw');
INSERT INTO Pieces(Code, Name) VALUES(3,'Nut');
INSERT INTO Pieces(Code, Name) VALUES(4,'Bolt');

INSERT INTO Provides(Piece, Provider, Price) VALUES(1,'HAL',10);
INSERT INTO Provides(Piece, Provider, Price) VALUES(1,'RBT',15);
INSERT INTO Provides(Piece, Provider, Price) VALUES(2,'HAL',20);
INSERT INTO Provides(Piece, Provider, Price) VALUES(2,'RBT',15);
INSERT INTO Provides(Piece, Provider, Price) VALUES(2,'TNBC',14);
INSERT INTO Provides(Piece, Provider, Price) VALUES(3,'RBT',50);
INSERT INTO Provides(Piece, Provider, Price) VALUES(3,'TNBC',45);
INSERT INTO Provides(Piece, Provider, Price) VALUES(4,'HAL',5);
INSERT INTO Provides(Piece, Provider, Price) VALUES(4,'RBT',7);

 * mysql://root:***@localhost/Pieces_and_Providers
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
show tables;

select * from Pieces;
select * from Providers;
select * from Provides;

 * mysql://root:***@localhost/Pieces_and_Providers
3 rows affected.
4 rows affected.
3 rows affected.
9 rows affected.

[(1, 'HAL', 10),
 (1, 'RBT', 15),
 (2, 'HAL', 20),
 (2, 'RBT', 15),
 (2, 'TNBC', 14),
 (3, 'RBT', 50),
 (3, 'TNBC', 45),
 (4, 'HAL', 5),
 (4, 'RBT', 7)]

In [8]:
%%sql
-- Select the name of all the pieces. 
select Name from Pieces;

 * mysql://root:***@localhost/Pieces_and_Providers
4 rows affected.

[('Sprocket',), ('Screw',), ('Nut',), ('Bolt',)]

In [10]:
%%sql
-- Select all the providers data. 
select * from Providers;

 * mysql://root:***@localhost/Pieces_and_Providers
3 rows affected.

[('HAL', 'Clarke Enterprises'),
 ('RBT', 'Susan Calvin Corp.'),
 ('TNBC', 'Skellington Supplies')]

In [11]:
%%sql
-- Obtain the average price of each piece (show only the piece code and the average price).
select piece, avg(price) 
from Provides 
group by piece;

 * mysql://root:***@localhost/Pieces_and_Providers
4 rows affected.

[(1, Decimal('12.5000')),
 (2, Decimal('16.3333')),
 (3, Decimal('47.5000')),
 (4, Decimal('6.0000'))]

In [12]:
%%sql
select Name 
from Providers
where Code in (
select  Provider from Provides where Piece = 1
);

 * mysql://root:***@localhost/Pieces_and_Providers
2 rows affected.

[('Clarke Enterprises',), ('Susan Calvin Corp.',)]

In [13]:
%%sql
-- Select the name of pieces provided by provider with code "HAL".
select Name from Pieces
where Code in (
select Piece from Provides where Provider = 'HAL'
);

 * mysql://root:***@localhost/Pieces_and_Providers
3 rows affected.

[('Sprocket',), ('Screw',), ('Bolt',)]

In [24]:
%%sql
SELECT Pieces.Name, Providers.Name, Price FROM Pieces INNER JOIN Provides ON Pieces.Code = Piece INNER JOIN Providers ON Providers.Code = Provider
WHERE Price =(  SELECT MAX(Price) FROM Provides WHERE Piece = Pieces.Code);

 * mysql://root:***@localhost/Pieces_and_Providers
4 rows affected.

[('Screw', 'Clarke Enterprises', 20),
 ('Sprocket', 'Susan Calvin Corp.', 15),
 ('Nut', 'Susan Calvin Corp.', 50),
 ('Bolt', 'Susan Calvin Corp.', 7)]

In [25]:
%%sql
-- Add an entry to the database to indicate that "Skellington Supplies" (code "TNBC") will provide sprockets (code "1") for 7 cents each.
INSERT INTO Provides(Piece, Provider, Price) VALUES (1, 'TNBC', 7);

 * mysql://root:***@localhost/Pieces_and_Providers
1 rows affected.

[]

In [27]:
%%sql
-- Increase all prices by one cent.
UPDATE Provides
SET Price = Price + 1;

 * mysql://root:***@localhost/Pieces_and_Providers
10 rows affected.

[]

In [28]:
%%sql
-- Update the database to reflect that "Susan Calvin Corp." (code "RBT") will not supply bolts (code 4).
DELETE FROM Provides WHERE provider = 'RBT' AND Piece = 4;

 * mysql://root:***@localhost/Pieces_and_Providers
1 rows affected.

[]

In [36]:
%%sql
/*--Update the database to reflect that "Susan Calvin Corp." (code "RBT") will not supply any pieces (the provider should still remain in the database).*/
DELETE FROM Provides
WHERE Provider = 'RBT'

 * mysql://root:***@localhost/Pieces_and_Providers
3 rows affected.

[]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql